docs: update frontmatter readme
